LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
  // 标记一次新的 OTA 开始，先清零本次计数，方便在异常重启时也能看到 OTA 已经触发过
  s_ota_last_size = 0;
  ota_diag_save_to_nvs(0, 1, 0);  // error=1: 进入 handler

  // 打印当前运行的分区信息
  const esp_partition_t *running = esp_ota_get_running_partition();
  if (running) {
    log_i("OTA: currently running from partition '%s' at offset 0x%lx, size 0x%lx", 
          running->label, (unsigned long)running->address, (unsigned long)running->size);
  }

  const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
  if (!update_partition) {
    log_e("OTA: no valid update partition");
    ota_diag_save_to_nvs(-1, ESP_ERR_NOT_FOUND, 0);
    return httpd_resp_send_500(req);
  }

  log_i("OTA: next update partition '%s' at offset 0x%lx, size 0x%lx", 
        update_partition->label, (unsigned long)update_partition->address, (unsigned long)update_partition->size);
  
  ota_diag_save_to_nvs(0, 2, 0);  // error=2: 找到分区
  
  // 检查固件大小是否会超出分区
  int content_len = req->content_len;
  if (content_len > (int)update_partition->size) {
    log_e("OTA: firmware size %d exceeds partition size %lu", content_len, (unsigned long)update_partition->size);
    ota_diag_save_to_nvs(-1, ESP_ERR_INVALID_SIZE, 0);
    return httpd_resp_send_500(req);
  }
  
  ota_diag_save_to_nvs(0, 21, content_len);  // error=21: 大小检查通过，用 size 记录固件大小

  log_i("OTA: calling esp_ota_begin (may take 10-30 seconds)...");
  esp_ota_handle_t ota_handle = 0;
  err = esp_ota_begin(update_partition, OTA_SIZE_UNKNOWN, &ota_handle);
  
  // 立即记录 esp_ota_begin 返回了（即使可能有错误）
  ota_diag_save_to_nvs(0, 3, err);  // error=3: esp_ota_begin 返回了，用 size 字段临时记录返回值
  log_i("OTA: esp_ota_begin returned: %d", err);
  
  if (err != ESP_OK) {
    log_e("OTA: esp_ota_begin failed: %d", err);
    ota_diag_save_to_nvs(-1, err, 0);
    return httpd_resp_send_500(req);
  }

  ota_diag_save_to_nvs(0, 4, 0);  // error=4: esp_ota_begin 成功，准备 malloc

  const size_t buf_size = 1024;
  uint8_t *buf = (uint8_t *)malloc(buf_size);
  if (!buf) {
    log_e("OTA: malloc failed");
    esp_ota_end(ota_handle);
    ota_diag_save_to_nvs(-1, ESP_ERR_NO_MEM, 0);
    return httpd_resp_send_500(req);
  }

  ota_diag_save_to_nvs(0, 5, 0);  // error=5: malloc 成功

  int remaining = req->content_len;
  if (remaining <= 0) {
    log_e("OTA: invalid content length %d", remaining);
    free(buf);
    esp_ota_end(ota_handle);
    ota_diag_save_to_nvs(-1, ESP_ERR_INVALID_SIZE, 0);
    return httpd_resp_send_500(req);
  }

  log_i("OTA: content_len=%d, starting receive", remaining);
  ota_diag_save_to_nvs(0, 6, 0);  // error=6: 准备接收数据

  int progress_counter = 0;
  while (remaining > 0) {
    int to_read = remaining > (int)buf_size ? (int)buf_size : remaining;
    int recv_len = httpd_req_recv(req, (char *)buf, to_read);
    if (recv_len <= 0) {
      log_e("OTA: recv error %d", recv_len);
      free(buf);
      esp_ota_end(ota_handle);
      ota_diag_save_to_nvs(-1, recv_len, s_ota_last_size);
      return httpd_resp_send_500(req);
    }

    err = esp_ota_write(ota_handle, buf, recv_len);
    if (err != ESP_OK) {
      log_e("OTA: esp_ota_write failed: %d", err);
      free(buf);
      esp_ota_end(ota_handle);
      ota_diag_save_to_nvs(-1, err, s_ota_last_size);
      return httpd_resp_send_500(req);
    }

    s_ota_last_size += recv_len;
    remaining -= recv_len;

    // 每接收 100KB 更新一次进度到 NVS，方便排查卡在哪个阶段
    progress_counter += recv_len;
    if (progress_counter >= 102400) {
      ota_diag_save_to_nvs(0, 0, s_ota_last_size);  // result=0 表示进行中
      progress_counter = 0;
    }
  }

  free(buf);

  err = esp_ota_end(ota_handle);
  if (err != ESP_OK) {
    log_e("OTA: esp_ota_end failed: %d", err);
    ota_diag_save_to_nvs(-1, err, s_ota_last_size);
    return httpd_resp_send_500(req);
  }

  err = esp_ota_set_boot_partition(update_partition);
  if (err != ESP_OK) {
    log_e("OTA: set_boot_partition failed: %d", err);
    ota_diag_save_to_nvs(-1, err, s_ota_last_size);
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_type(req, "text/plain");
  httpd_resp_sendstr(req, "OK");

  log_i("OTA: update successful, restarting");
  ota_diag_save_to_nvs(1, ESP_OK, s_ota_last_size);
  nvs_handle_t h_flag;
  esp_err_t err_flag = nvs_open(OTA_NVS_NAMESPACE, NVS_READWRITE, &h_flag);
  if (err_flag == ESP_OK) {
    int32_t flag = 1;
    nvs_set_i32(h_flag, OTA_NVS_KEY_PREERASE, flag);
    nvs_commit(h_flag);
    nvs_close(h_flag);
  } else {
    log_e("OTA: nvs_open for preerase flag failed: %d", err_flag);
  }
  vTaskDelay(1000 / portTICK_PERIOD_MS);
  esp_restart();

  return ESP_OK;
}

static esp_err_t ota_options_handler(httpd_req_t *req) {
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "POST, OPTIONS");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type");
  return httpd_resp_send(req, NULL, 0);
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index) {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK) {
    return 0;
  }
  j->len += len;
  return len;
}

static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_start = esp_timer_get_time();
#endif

  fb = esp_camera_fb_get();

  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  if (fb->format == PIXFORMAT_JPEG) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = fb->len;
#endif
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jchunk.len;
#endif
  }
  esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %uB %ums", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
  return res;
}

static esp_err_t snapshot_to_router_handler(httpd_req_t *req) {
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    log_e("snapshot_to_router: camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  char router_host[64];
  snprintf(router_host, sizeof(router_host), "%s", SNAPSHOT_ROUTER_DEFAULT_HOST);
  int router_port = SNAPSHOT_ROUTER_DEFAULT_PORT;
  char router_path[128];
  snprintf(router_path, sizeof(router_path), "%s", SNAPSHOT_ROUTER_DEFAULT_PATH);

  size_t qlen = httpd_req_get_url_query_len(req);
  if (qlen > 0) {
    char *query = (char *)malloc(qlen + 1);
    if (query) {
      if (httpd_req_get_url_query_str(req, query, qlen + 1) == ESP_OK) {
        char value[96];
        if (httpd_query_key_value(query, "host", value, sizeof(value)) == ESP_OK) {
          snprintf(router_host, sizeof(router_host), "%s", value);
        }
        if (httpd_query_key_value(query, "port", value, sizeof(value)) == ESP_OK) {
          int p = atoi(value);
          if (p > 0 && p < 65536) {
            router_port = p;
          }
        }
        if (httpd_query_key_value(query, "path", value, sizeof(value)) == ESP_OK) {
          if (value[0] != '\0') {
            snprintf(router_path, sizeof(router_path), "%s", value);
          }
        }
      }
      free(query);
    }
  }

