LissajousX/smallcar/esp32_cam/CameraWebServer/app_httpd.cpp
  WiFiClient client;
  if (!client.connect(router_host, router_port)) {
    log_e("snapshot_to_router: connect to %s:%d failed", router_host, router_port);
    esp_camera_fb_return(fb);
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  client.printf("POST %s HTTP/1.1\r\n", router_path);
  client.printf("Host: %s:%d\r\n", router_host, router_port);
  client.print("Content-Type: image/jpeg\r\n");
  client.printf("Content-Length: %u\r\n", (unsigned int)fb->len);
  client.print("Connection: close\r\n");
  client.print("\r\n");

  size_t written = 0;
  const uint8_t *buf = fb->buf;
  size_t len = fb->len;
  while (written < len) {
    size_t w = client.write(buf + written, len - written);
    if (w == 0) {
      break;
    }
    written += w;
  }

  esp_camera_fb_return(fb);

  if (written != len) {
    log_e("snapshot_to_router: short write %u/%u", (unsigned int)written, (unsigned int)len);
    client.stop();
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  uint32_t start = millis();
  while (client.connected() && (millis() - start) < 2000) {
    while (client.available()) {
      (void)client.read();
    }
    delay(10);
  }
  client.stop();

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_type(req, "application/json");
  char resp[160];
  int n = snprintf(
    resp,
    sizeof(resp),
    "{\"ok\":true,\"host\":\"%s\",\"port\":%d,\"path\":\"%s\",\"bytes\":%u}",
    router_host,
    router_port,
    router_path,
    (unsigned int)written
  );
  if (n < 0 || n >= (int)sizeof(resp)) {
    httpd_resp_send(req, "{\"ok\":true}", strlen("{\"ok\":true}"));
  } else {
    httpd_resp_send(req, resp, n);
  }
  return ESP_OK;
}

static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char *part_buf[128];

  static int64_t last_frame = 0;
  if (!last_frame) {
    last_frame = esp_timer_get_time();
  }

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "X-Framerate", "60");

#if CONFIG_LED_ILLUMINATOR_ENABLED
  isStreaming = true;
#endif

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted) {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    }
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }
    if (res != ESP_OK) {
      log_e("Send frame failed");
      break;
    }
    int64_t fr_end = esp_timer_get_time();

    int64_t frame_time = fr_end - last_frame;
    frame_time /= 1000;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
    // 只每 30 帧打印一次，减少串口开销
    static int log_counter = 0;
    if (++log_counter >= 30) {
      log_counter = 0;
      log_i(
        "MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)", (uint32_t)(_jpg_buf_len), (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time, avg_frame_time,
        1000.0 / avg_frame_time
      );
    }
#endif
    last_frame = fr_end;
    
    // === CRITICAL: 让出 CPU 给 WiFi/TCP 栈和看门狗 ===
    vTaskDelay(1);  // 1 tick，避免任务饥饿
  }

#if CONFIG_LED_ILLUMINATOR_ENABLED
  isStreaming = false;
  enable_led(false);
#endif

  return res;
}

static esp_err_t parse_get(httpd_req_t *req, char **obuf) {
  char *buf = NULL;
  size_t buf_len = 0;

  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      *obuf = buf;
      return ESP_OK;
    }
    free(buf);
  }
  httpd_resp_send_404(req);
  return ESP_FAIL;
}

static esp_err_t cmd_handler(httpd_req_t *req) {
  char *buf = NULL;
  char variable[32];
  char value[32];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK || httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  // 画质预设：在解析数值之前单独处理，支持字符串取值
  if (!strcmp(variable, "preset")) {
    sensor_t *s = esp_camera_sensor_get();
    if (!s) {
      return httpd_resp_send_500(req);
    }

    int pres_res = 0;
    if (!strcmp(value, "low")) {
      log_i("Apply preset: low");
      if (s->pixformat == PIXFORMAT_JPEG) {
        pres_res |= s->set_framesize(s, FRAMESIZE_QVGA);
      }
      pres_res |= s->set_quality(s, 20);   // 较小分辨率 + 较高压缩，追求流畅
      pres_res |= s->set_brightness(s, 0);
      pres_res |= s->set_contrast(s, 0);
      pres_res |= s->set_saturation(s, 0);
    } else if (!strcmp(value, "normal")) {
      log_i("Apply preset: normal");
      if (s->pixformat == PIXFORMAT_JPEG) {
        pres_res |= s->set_framesize(s, FRAMESIZE_VGA);
      }
      pres_res |= s->set_quality(s, 12);   // 画质/延迟折中
      pres_res |= s->set_brightness(s, 0);
      pres_res |= s->set_contrast(s, 0);
      pres_res |= s->set_saturation(s, 0);
    } else if (!strcmp(value, "high")) {
      log_i("Apply preset: high");
      if (s->pixformat == PIXFORMAT_JPEG) {
        pres_res |= s->set_framesize(s, FRAMESIZE_SVGA);
      }
      pres_res |= s->set_quality(s, 10);   // 更高画质，带来一定带宽/负载增加
      pres_res |= s->set_brightness(s, 0);
      pres_res |= s->set_contrast(s, 0);
      pres_res |= s->set_saturation(s, 0);
    } else {
      log_i("Unknown preset: %s", value);
      pres_res = -1;
    }

    if (pres_res < 0) {
      return httpd_resp_send_500(req);
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
  }

